## Plan Result (Infrastructure)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dcd-cftapps-demo)&#34;]
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dcd-cftapps-dev)&#34;]
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dcd-cftapps-ithc)&#34;]
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dcd-cftapps-prod)&#34;]
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dcd-cftapps-sbox)&#34;]
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dcd-cftapps-stg)&#34;]
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dcd-cftapps-test)&#34;]
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dts-cftptl-intsvc)&#34;]
  * azurerm_role_assignment.reader[&#34;DTS Bootstrap (sub:dts-cftsbox-intsvc)&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dcd-cftapps-demo)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "047fc0c7-abf4-405c-ac3f-5f1f9527c9e7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dcd-cftapps-dev)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "933c1e6e-7915-4ac9-aee2-f0a67ba626ae"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dcd-cftapps-ithc)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9a3b951-3f7d-46f5-a2d5-e0ecb41bcfd3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dcd-cftapps-prod)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98053eb3-8523-4c5a-96d3-c15532f87c19"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dcd-cftapps-sbox)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "173fde48-bd6b-44f1-bb63-6fe6c90424ca"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dcd-cftapps-stg)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c822a60c-d948-46f2-a4ce-b1c7ecd33f2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dcd-cftapps-test)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7fa5dd91-6812-42cc-a93f-377f7d4c9e1e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dts-cftptl-intsvc)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b8f08f77-4ce2-43d5-a23b-c7ca735eca02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.reader["DTS Bootstrap (sub:dts-cftsbox-intsvc)"] will be created
  + resource "azurerm_role_assignment" "reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2070d748-c35c-478f-a5ca-ec8a5c4ff10d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-version-reporter-ptl-rg/providers/Microsoft.KeyVault/vaults/version-reporter-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":177,"Program":"tfcmt","SHA1":"","Target":"Infrastructure","Vars":{}} -->